ИС_СПОРТ_2022/src/Reports/СписокГрупп/СписокГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СписокГрупп</name>
</mdclass:Report>

ИС_СПОРТ_2022/src/Catalogs/Тренеры/Тренеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тренеры</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПедагогическийСтажРаботыС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТренера</name>
    <type>
      <types>EnumRef.СтатусыТренеров</types>
    </type>
  </attributes>
  <attributes>
    <name>СовпадаетАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Reports/СписокГрупп/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда
		Возврат;
	КонецЕсли;	
	
	КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("УчебныйГодДокумент");
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Параметр.Значение = ПолучитьУчебныйГод();
	Параметр.Использование = Истина;
	
	Если ЗначениеЗаполнено(Параметр.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Параметр.Значение;
			ПользовательскийПараметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Период");
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Параметр.Значение = ТекущаяДата();
	Параметр.Использование = Истина;
	
	Если ЗначениеЗаполнено(Параметр.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Параметр.Значение;
			ПользовательскийПараметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементОтбораИД = КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ИдентификаторПользовательскойНастройки;
	ПользовательскийЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбораИД);
	ПользовательскийЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ПользовательскийЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Тренеры.ПустаяСсылка");
	ПользовательскийЭлементОтбора.Использование = Ложь;
			
КонецПроцедуры

&НаСервере
Функция ПолучитьУчебныйГод()
	Возврат УчетСпортсменовСервер.ПолучитьДокументТекущегоУчебногоГода();
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ВариантМодифицирован = Ложь;
КонецПроцедуры
